Repository: acastrodev/stride-docs-catproject
Catalog: stride-docs-level2.tmx
Source language: en
Languages: pt_br

source: Sync/Merge Upstream with Your Forked Main Branch: Post-merge, ensure your forked repository's main branch is updated to include your newly merged changes.
pt_br: Sincronize/Mescle o repositório original com o seu fork (branch main): Depois da mesclagem, atualize o branch principal do seu fork com as últimas mudanças.

source: TR.Stride: Various stride environment utilities
pt_br: TR.Stride: Vários utilitários de ambiente para o Stride

source: Tabs: Organize content into tabbed sections for improved readability
pt_br: Abas (Tabs): Organiza conteúdo em seções com abas para melhorar a legibilidade.

source: Tessellation
pt_br: Tesselamento

source: Test Your Updates: Thoroughly test your updates to confirm they work as expected and do not introduce new issues.
pt_br: Teste suas alterações: Teste cuidadosamente suas alterações para garantir que estão funcionando corretamente e que não causam novos problemas.

source: Text Control
pt_br: Controle de texto

source: Trigger Example
pt_br: Exemplo de acionador

source: Triplanar shader
pt_br: Shader triplanar

source: Try it out yourself
pt_br: Experimente agora mesmo!

source: Tutorials by Manio143
pt_br: Tutoriais por Manio

source: Tweening library
pt_br: Biblioteca de interpolação (Tweening)

source: Types of Changes: Categorizing the nature of the changes.
pt_br: Tipos de alterações: Classificação do tipo de alteração.

source: UI Navigation
pt_br: Navegação de interface

source: Unleash your inner coder
pt_br: Libere o programador que existe em você!

source: UnrealMotion: Motion blur for stride
pt_br: UnrealMotion: Motion blur para o Stride

source: UnrealMotion - Unreal engine motion blur for Stride
pt_br: UnrealMotion - Desfoque de movimento do motor de jogo Unreal para o Stride

source: Update or Add Relevant Documentation: Contribute to the project's documentation to reflect your changes, helping future users and contributors understand the new functionalities or fixes.
pt_br: Atualize ou Adicione a Documentação Relevante: Contribua com a documentação do projeto para refletir suas mudanças e ajudar outros usuários e colaboradores a entenderem as novas funcionalidades ou correções.

source: Use <remarks></remarks>: For additional context or usage examples, the <remarks> tag can be used within XML comments to provide supplementary information.
pt_br: Utilize <remarks></remarks>: para incluir contexto adicionais ou exemplos de uso, a marca <remarks> pode ser usada dentro dos comentários XML para fornecer informações complementares.

source: Using Entity Processors for Scene Editor Plugins
pt_br: Utilizando processadores de entidade para plugins do Editor de Cenas

source: VVVV Visual scripting with Stride
pt_br: Script visual VVVV com Stride

source: VVVV core shaders
pt_br: Shaders principais do VVVV

source: VVVV uses Stride for 3D rendering
pt_br: VVVV utiliza o Stride para renderização 3D

source: VVVVarkle with vvvv rendered using Stride
pt_br: VVVVarkle com vvvv renderizado usando Stride

source: Vehicle Script
pt_br: Script de veículo

source: Video demo
pt_br: Demonstração em vídeo

source: Video: Embed video content directly into your documentation
pt_br: Vídeo: Incorpora conteúdo de vídeo diretamente na documentação.

source: Voxel GI example
pt_br: Exemplo de Iluminação global com voxels (Voxel GI)

source: VoxelGIPrototype - VXGI inspired Global Illumination shaders (merged as of Stride v4beta2)
pt_br: VoxelGIPrototype - Shaders de Iluminação Global inspirados em VXGI (incorporados a partir do Stride v4beta2)

source: Wait for PR to be Merged by Maintainers: After approval, maintainers will merge your PR into the project.
pt_br: Aguarde a mesclagem do PR pelos mantenedores: Após a aprovação, os mantenedores irão mesclar seu PR no repositório principal.

source: We will tell you why
pt_br: Confira agora!

source: Workshop creating a game with Stride
pt_br: Oficina: criando um jogo com Stride

source: XML Comments: All public members intended for use should include descriptive XML comments.
pt_br: Comentários XML: Todos os membros públicos destinados ao uso devem conter comentários XML descritivos.

source: Xenko Game Engine: How The Makers Of Bravely Default Want To Help Develop Better VR Games
pt_br: Motor de jogo Xenko: Como os criadores de Bravely Default querem ajudar no desenvolvimento de melhores jogos para VR

source: Xenko Live Editor
pt_br: Editor Xenko em tempo real

source: Xenko Procedural Terrain Generation & Water tests
pt_br: Geração Procedural de Terreno e Testes de Água do Xenko

source: Xenko TPS example
pt_br: Xenko TPS (Exemplo)

source: Xenko Voxel Scape
pt_br: Voxel Scape no Xenko

source: Xenko/Stride byte-sized project examples
pt_br: Exemplos compactos de projetos Xenko/Stride

source: XenkoByteSized - Split Screen
pt_br: XenkoByteSized - Tela dividida

source: XenkoByteSized - Subdivided Plane Mesh
pt_br: XenkoByteSized - Malha de plano subdividido

source: XenkoByteSized - Various Procedural Renderings
pt_br: XenkoByteSized - Várias renderizações procedurais

source: XenkoHMTerrain - Height Map Terrain
pt_br: XenkoHMTerrain - Terreno com mapa de altura

source: XenkoMCTerrain - Marching Cubes Terrain
pt_br: XenkoMCTerrain - Terreno de marching cubes

source: XenkoTerrain - Mesh terrain implementation
pt_br: XenkoTerrain - Implementação de terreno em malha

source: XenkoVisualStudioTemplates - Script and shader templates for Visual Studio
pt_br: XenkoVisualStudioTemplates - Templates de scripts e shaders para Visual Studio

source: XenkoVoxelExample - minecraft like voxel brick world
pt_br: XenkoVoxelExample - mundo de blocos voxel estilo Minecraft

source: XenkoWindowFromCode - Launch a game window from code only
pt_br: XenkoWindowFromCode - Iniciar uma janela de jogo apenas com código

source: breaking-change label: If the PR introduces a breaking change, it should be labelled as such.
pt_br: breaking-change: Se o PR introduz uma mudança incompatível com versões anteriores.

source: bug-fix label: If the PR fixes a bug, it should be labelled as such.
pt_br: bug-fix: Se o PR corrige um erro.

source: demo of vxgi implementation in Xenko game engine
pt_br: demo da implementação de vxgi no motor de jogo Xenko

source: docfx.json - The HTML footer is included in the _appFooter section
pt_br: docfx.json – O rodapé HTML está incluído na seção _appFooter

source: enhancement label: If the PR introduces a new feature or improvement, it should be labelled accordingly.
pt_br: enhancement: Se o PR traz uma nova funcionalidade ou melhoria.

source: stride-docs-release-azure.yml: Automates deployment to production upon merging changes into the release branch, with a manual trigger option also available.
pt_br: stride-docs-release-azure.yml: Automatiza a implantação em produção ao mesclar alterações na branch release, com opção de acionador manual.

source: stride-docs-release-fast-track-azure.yml: Provides manual deployment to production, bypassing the creation of artifacts.
pt_br: stride-docs-release-fast-track-azure.yml: Permite implantação manual em produção, ignorando a criação de artefatos.

source: stride-docs-staging-azure.yml: Facilitates automatic deployment to staging when changes are merged into the staging branch, and includes a manual trigger option.
pt_br: stride-docs-staging-azure.yml: Facilita a implantação automática para staging quando mudanças são mescladas na branch staging, com opção de execução manual.

source: stride-docs-staging-fast-track-azure.yml: Allows for manual deployment to staging, skipping the creation of artifacts.
pt_br: stride-docs-staging-fast-track-azure.yml: Permite implantação manual em staging, ignorando a criação de artefatos.

source: stride-website-github.yml: Enables manual deployment to GitHub Pages in a forked repository, primarily for showcasing updates.
pt_br: stride-website-github.yml: Permite implantação manual no GitHub Pages em um repositório forkado, usado principalmente para demonstrar atualizações.

source: stride-website-wiki.yml: Automatically deploys to the GitHub Wiki when changes are pushed to the wiki folder in the master branch, also includes a manual trigger feature
pt_br: stride-website-wiki.yml: Implanta automaticamente no GitHub Wiki quando mudanças são feitas na pasta wiki da branch master, incluindo a opção de acionador manual.

source: template/partials/affix.tmpl.partial - Currently not functioning
pt_br: template/partials/affix.tmpl.partial – Atualmente não funcional

source: template/partials/footer.tmpl.partial - Currently not functioning
pt_br: template/partials/footer.tmpl.partial – Atualmente não funcional

source: template/public/main.css - Contains minor Bootstrap CSS overrides
pt_br: template/public/main.css – Contém pequenas personalizações do CSS do Bootstrap

source: vvvv Showcase - Many large-scale interactive media projects made with vvvv
pt_br: vvvv Showcase - Muitos projetos interativos de mídia em grande escala feitos com vvvv

source: Lead developer of Stride
pt_br: Desenvolvedor líder do Stride

source: Original developer of Stride
pt_br: Desenvolvedor original do Stride

source: (Original & Current)
pt_br: (Original e Atual)

source: A crucial part of this template is the checklist, which includes verifying documentation needs, adding tests for new features, ensuring all tests pass, and notably, confirming that you have built and run the editor to test your changes personally.
pt_br: Um dos pontos mais importantes do modelo é o checklist, que inclui tarefas como: - Verificar se há necessidade de atualizar a documentação; - Adicionar testes para novos recursos; - Garantir que todos os testes estejam passando; E, principalmente, confirmar que você construiu e executou o editor para testar suas alterações localmente.

source: API Documentation
pt_br: Documentação da API

source: A[Fork the Repository]
pt_br: A[Faça um fork do repositório]

source: Add Custom Domain
pt_br: Adicionando um domínio personalizado

source: Add a new manual or tutorial or any new content
pt_br: Adicionar um novo manual ou tutorial ou qualquer outro conteúdo novo

source: Additionally, for demonstration purposes, you can refer to the Deployment to GitHub Pages section for alternative deployment strategies you can use to showcase your updates.
pt_br: Além disso, para fins de demonstração, consulte a seção Implantação de páginas no GitHub para conhecer estratégias alternativas de implantação que você pode usar para apresentar suas atualizações.

source: Adjust this setting based on your deployment needs.
pt_br: Ajuste essa configuração conforme necessário.

source: Adjusting the Web App Configuration
pt_br: Ajustando a configuração do Aplicativo Web

source: After making and testing your changes locally, you should create a pull request to merge your changes into the master branch.
pt_br: Após realizar e testar suas mudanças localmente, envie um pull request para mesclá-las na branch master.

source: After saving, an internal GitHub Action pages build and deployment is automatically created and triggered, deploying the content to the GitHub Pages website
pt_br: Após salvar, uma GitHub Action interna pages build and deployment será automaticamente criada e acionada, implantando o conteúdo no site do GitHub Pages

source: Animation
pt_br: Animação

source: Articles
pt_br: Artigos

source: Asset compiler
pt_br: Compilador de assets

source: Asset pipeline
pt_br: Pipeline de assets

source: Asset system
pt_br: Sistema de assets

source: B[Create Branch 'X']
pt_br: B[Crie um branch 'X']

source: Belgium
pt_br: Bélgica

source: Best Practices
pt_br: Boas práticas

source: Bootstrap Customization
pt_br: Personalização do Bootstrap

source: Build
pt_br: Construção

source: C# in general
pt_br: C# em geral

source: CSS Guidelines
pt_br: Diretrizes de CSS

source: C[Make Updates on Branch 'X']
pt_br: C[Realize as alterações no branch 'X']

source: Camera
pt_br: Câmera

source: Canada
pt_br: Canadá

source: Change Ftp state to FTPS only
pt_br: Altere o estado Ftp para somente FTPS

source: Change HTTPS Only to On
pt_br: Altere somente HTTPS para Ligado

source: Change the Http version to 2.0
pt_br: Altere a versão Http para 2.0

source: Change the version in the URL accordingly.
pt_br: Altere a versão na URL conforme necessário.

source: Choose Create a Web App
pt_br: Escolha Criar Aplicativo Web

source: Choose Read and write permissions
pt_br: Escolha Read and write permissions

source: Choose the gh-pages branch with the root option and click Save
pt_br: Escolha a branch gh-pages com a opção root e clique em Save

source: Choose your existing subscription and resource group
pt_br: Escolha sua assinatura e grupo de recursos existentes

source: Click Create
pt_br: Clique em Criar

source: Click Next
pt_br: Clique em Avançar

source: Click Run workflow; you may optionally select a branch
pt_br: Clique em Run workflow; você pode selecionar uma branch, se desejar

source: Click Save to apply the changes
pt_br: Clique em Salvar para aplicar as alterações

source: Click on Configuration
pt_br: Clique em Configuração

source: Code Only
pt_br: Somente código

source: Code blobs
pt_br: Trechos de código

source: Community Resources
pt_br: Recursos da comunidade

source: Community meetings
pt_br: Reuniões com a comunidade

source: Content Updates
pt_br: Atualizações de conteúdo

source: Contributing to Stride not only involves code changes but also requires keeping the documentation, including the API Docs and Manual, current and comprehensive.
pt_br: Contribuir com o Stride não envolve apenas alterações no código, mas também requer manter a documentação — incluindo a Documentação da API e o Manual — atualizado e abrangente.

source: Contribution Workflow for Stride Projects
pt_br: Fluxo de contribuição para projetos Stride

source: Controlling Patches
pt_br: Controlando patches

source: Core Team
pt_br: Equipe principal

source: Create a new index.md file in this folder.
pt_br: Crie um novo arquivo index.md dentro dessa pasta.

source: Create a new file in the manual folder, in the already existing folders (e.g. animation, audio, ..) or create a new folder in the manual folder.
pt_br: Crie um novo arquivo na pasta manual, em uma das pastas já existentes (por exemplo, animation, audio, etc.) ou crie uma nova pasta dentro da pasta manual.

source: Create a new tutorial folder in the tutorial folder.
pt_br: Crie uma nova pasta de tutorial dentro da pasta tutorial.

source: Create markdown files for each step of the tutorial.
pt_br: Crie arquivos markdown para cada etapa do tutorial.

source: Creating New Manual Page
pt_br: Criando uma nova página de manual

source: Creating New Tutorial Page
pt_br: Criando uma nova página de tutorial

source: Creating an issue is not required for small updates, but it is recommended to let others know what you are working on.
pt_br: Criar uma issue não é obrigatório para pequenas atualizações, mas é recomendável avisar outros colaboradores sobre o que você está fazendo.

source: Currently we use Standard S1.
pt_br: Atualmente usamos Standard S1.

source: D -->|No| G
pt_br: D -->|Não| G

source: D -->|Yes| E
pt_br: D -->|Sim| E

source: Data Types & IOBoxes
pt_br: Tipos de dados e IOBoxes

source: Deploying to Azure Web Apps (Windows) with IIS
pt_br: Implantação do Azure Aplicativo Web (Windows) com IIS

source: Deployment
pt_br: Implantação

source: Deployment to GitHub Pages
pt_br: Implantação no GitHub Pages

source: Deployments to Azure Web Apps are automated through GitHub Actions, forming an integral part of our Continuous Integration/Continuous Deployment (CI/CD) process.
pt_br: As implantações no Azure Aplicativo Web são automatizadas por meio do GitHub Actions, integrando-se ao nosso processo de Integração Contínua / Entrega Contínua (CI/CD).

source: Detailed Steps
pt_br: Passos detalhados

source: Disable Application Insights - This is not needed at this stage
pt_br: Desabilite o Application Insights – Isso não é necessário neste estágio

source: Docfx supports additional markdown syntax to enrich content.
pt_br: O Docfx oferece suporte a sintaxes adicionais em markdown para enriquecer o conteúdo.

source: Documenation
pt_br: Documentação

source: Documentation
pt_br: Documentação

source: Documentation content
pt_br: Conteúdo da documentação

source: D{Has the Upstream Changed?}
pt_br: D{O repositório original foi atualizado?}

source: E[Sync/Merge Upstream with Forked Main Branch]
pt_br: E["Sincronize/Mescle o repositório original com seu fork <br>(branch main)"]

source: Enable Continuous deployment
pt_br: Habilite a opção Implantação contínua

source: Enforcing Documentation Updates
pt_br: Garantindo as atualizações na documentação

source: Engage with the Stride community for support and collaboration
pt_br: Participe da comunidade do Stride para obter suporte e colaborar com outros desenvolvedores.

source: Engine Documentation
pt_br: Documentação do motor de jogos

source: Ensure you select the correct branch staging and click Run workflow.
pt_br: Certifique-se de selecionar a branch correta staging e clique em Run workflow.

source: Ensure your modifications align with the project's standards and guidelines.
pt_br: Garanta que suas modificações estejam em conformidade com os padrões e diretrizes do projeto.

source: Ensure your updates align with the project goals and guidelines
pt_br: Garanta que suas contribuições estejam alinhadas com os objetivos e diretrizes do projeto.

source: Ensuring documentation updates with every change helps users and contributors alike understand and utilize Stride's features effectively.
pt_br: Garantir atualizações na documentação com cada alteração ajuda usuários e colaboradores a entender e utilizar os recursos do Stride de forma eficaz.

source: Enter the magical world of shaders.
pt_br: Entre no mundo mágico dos shaders.

source: Enter your custom domain and follow the instructions for verification
pt_br: Insira seu domínio personalizado e siga as instruções para verificação

source: Entity Component System
pt_br: Sistema-Componente-Entidade

source: Example of a generated PR titles.
pt_br: Exemplos de títulos de PRs gerados.

source: Example projects
pt_br: Exemplos de projetos

source: Examples
pt_br: Exemplos

source: Examples for you to try and dig into.
pt_br: Exemplos para você testar e explorar.

source: Execute the workflow stride-docs-staging-azure.yml.
pt_br: Execute o workflow stride-docs-staging-azure.yml.

source: Extension Libraries
pt_br: Bibliotecas de extensão

source: F[Sync/Merge Forked Main Branch with Branch 'X']
pt_br: F[Sincronize/Mescle o branch main do fork com o branch 'X']

source: Feel free to browse the API documentation by namespace, and don't hesitate to consult the Stride community or GitHub repository for further assistance and resources.
pt_br: Sinta-se à vontade para navegar na documentação da API utilizando os namespaces, e não hesite em consultar a comunidade do Stride ou o repositório GitHub para uma maior assistência e recursos adicionais.

source: Fix a typo
pt_br: Corrigir erros de digitação

source: Focus / Expertise
pt_br: Área de foco / Especialidade

source: Follow the established formats and conventions to ensure consistency and clarity throughout the documentation.
pt_br: Siga os formatos e convenções estabelecidos para garantir consistência e clareza em toda a documentação.

source: Follow these instructions carefully to establish your Azure Web App in a staging environment.
pt_br: Siga atentamente estas instruções para criar seu Azure Aplicativo Web em um ambiente de staging.

source: For Stride-specific labels, the prefix should follow the commit convention, e.g., feat:, fix:, perf:, docs:, style:, refactor:, test:, chore:, or any designation the maintainer sees fit.
pt_br: Para rótulos específicos do Stride, o prefixo deve seguir a convenção de commits, por exemplo: feat:, fix:, perf:, docs:, style:, refactor:, test:, chore: ou outro prefixo apropriado.

source: For a suggested workflow on contributing to Stride, please check our Contribution Workflow.
pt_br: Para entender melhor como contribuir com o Stride, consulte o nosso fluxo de contribuição.

source: For deploying in a production environment, replicate these steps with an alternate web app name for differentiation.
pt_br: Para implantar em produção, repita estes passos utilizando um nome diferente para o aplicativo web.

source: For generic labels, use square brackets to state the Stride category the PR belongs to, e.g., [Assets], [OpenXR], [Tests], [Graphics], [Physics], [UI], [Audio], [Input], [Launcher], [GameStudio], [Build], [Doc], [Samples], [Shaders], [Performance], [Engineering], or any category the maintainer sees fit.
pt_br: Para rótulos genéricos, use colchetes com a categoria do Stride à qual o PR pertence, por exemplo: [Assets], [OpenXR], [Tests], [Graphics], [Physics], [UI], [Audio], [Input], [Launcher], [GameStudio], [Build], [Doc], [Samples], [Shaders], [Performance], [Engineering] ou qualquer outra categoria que o mantenedor julgar adequada.

source: For instance, Stride Docs deployment retains files from previous deployments, allowing multiple versions like 4.2, 4.1, etc., to be maintained.
pt_br: Por exemplo, a implantação do Stride Docs mantém arquivos de versões anteriores, permitindo múltiplas versões como 4.2, 4.1, etc.

source: For more information, read the Docfx documentation on markdown, shortcodes and includes.
pt_br: Para mais informações, leia a documentação do Docfx sobre markdown, shortcodes e includes.

source: For more specific guidelines related to each project, refer to their respective contribution documentation.
pt_br: Para diretrizes específicas de cada projeto, consulte a documentação de contribuição correspondente.

source: For the benefit of both IDE users and those utilizing the generated API Docs, it's crucial that any public interfaces, classes, methods, properties in C# are thoroughly documented with XML comments.
pt_br: Para beneficiar tanto usuários da IDE quanto aqueles que utilizam a documentação da API gerada, é fundamental que todas as interfaces, classes, métodos e propriedades públicas em C# sejam devidamente documentadas com comentários XML.

source: For the following instructions, use the Stride Docs GitHub repository:
pt_br: Para seguir as instruções abaixo, use o repositório oficial do Stride Docs no GitHub:

source: France
pt_br: França

source: From procedural mesh to animation controllers.
pt_br: De malha procedural a controladores de animação.

source: G[Test Your Updates]
pt_br: G[Teste suas alterações]

source: Games
pt_br: Jogos

source: Games and demos
pt_br: Jogos e demos

source: Games, demo's and prototypes that people made.
pt_br: Jogos, demos e protótipos criados pela comunidade.

source: General tools, Asset handling and importer tools
pt_br: Ferramentas gerais, manipulação de assets e ferramentas de importação.

source: Germany
pt_br: Alemanha

source: Get your hands dirty with code, scripts, and more.
pt_br: Coloque as mãos na massa com código, scripts e muito mais.

source: GitHub Pull Request Guidelines
pt_br: Diretrizes para realizar pull requests no GitHub

source: Go to Actions, select Build Stride Docs for GitHub Staging
pt_br: Acesse Actions, selecione Build Stride Docs for GitHub Staging

source: Go to Settings → Pages → Custom domain
pt_br: Acesse Settings → Pages → Custom domain

source: Graphics
pt_br: Gráficos

source: Groundbreaking stuff and H2O related topics.
pt_br: Por terra ou pela água, este é o lugar.

source: H["Create a Pull Request (PR)"]
pt_br: H["Crie um Pull Request (PR)"]

source: Have a look around for inspiration or perhaps for something that you can reuse for your project.
pt_br: Dê uma olhada para se inspirar ou, talvez, encontrar algo que você possa reutilizar no seu projeto.
